app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_article
    # Ensure that the article belongs to the current organization
    @article = current_user.organization.articles.find(params[:id])