app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "post 1"], ["body", "this is post 1"], ["created_at", "2024-08-05 07:22:59.739406"], ["updated_at", "2024-08-05 07:22:59.739406"]]
---
  def create
    @article = current_user.articles.build(article_params)
    if @article.save