app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "build blog"], ["body", "build"], ["article_id", 1], ["created_at", "2024-08-06 04:52:05.666780"], ["updated_at", "2024-08-06 04:52:05.666780"], ["status", "private"]]
---
    def create
      @article = Article.find(params[:article_id])
      puts @article
      @comment = @article.comments.create(comment_params)